<style  type="text/css"> 
cool {
  width: 100px;
  height: 100px;
  background-color: red;
  position: relative;
  -webkit-animation-name: example; /* Safari 4.0 - 8.0 */
  -webkit-animation-duration: 4s; /* Safari 4.0 - 8.0 */
  -webkit-animation-iteration-count: infinite; /* Safari 4.0 - 8.0 */
  animation-name: example;
  animation-duration: 4s;
  animation-iteration-count: infinite;
}

/* Safari 4.0 - 8.0 */
@-webkit-keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}

/* Standard syntax */
@keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}
</style>

<b><center>
<span style="font-size: 24pt; line-height: 1.2">
COMS W4111: Introduction to Databases<br>
Fall 2023, Sections 002
</span>
</center></b>
</span><br>
<p>
<i><center>
<span style="font-size: 20pt; line-height: 1.2">
Lecture 2: Examples<br>
</span>
</center></i>

# Setup

- Using the examples requires installing [ipython-sql.](https://pypi.org/project/ipython-sql/)


- Instructions: https://www.geeksforgeeks.org/how-to-install-ipython-sql-package-in-jupyter-notebook/


- You may also need to install [pymysql](https://pypi.org/project/PyMySQL/) and [SQLAlchemy](https://www.sqlalchemy.org/).


- You must replace ```root:dbuserdbuser``` with the user ID and password you defined when installing MySQL.

In [2]:
%load_ext sql

In [3]:
%sql mysql+pymysql://root:dbuserdbuser@localhost

# Sample Database

- I have installed the [sample database](https://www.db-book.com/university-lab-dir/sample_tables-dir/index.html) associated with the textbook.


- You can find instructions for loading the data in [DataGrip documentation](https://www.jetbrains.com/help/datagrip/import-data.html#import-data-to-a-database).


- There are a couple of things you would need to know about SQL to run the scrips. So, I simplified in put in the lecture 1 directory.


- __Note: Show demo of running the scripts in DataGrip. This assumes the student has installed MySQL.__

- This runs a couple of simple queries.

In [4]:
# We have connected to the database server.
# Specify the database we want to use. This is similar to cd into a directory.
#
%sql use db_book;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

- List the tables in the database (schema).


- This is similar to ```ls``` or ```dir```.

In [4]:
%sql show tables;

 * mysql+pymysql://root:***@localhost
11 rows affected.

[('advisor',),
 ('classroom',),
 ('course',),
 ('department',),
 ('instructor',),
 ('prereq',),
 ('section',),
 ('student',),
 ('takes',),
 ('teaches',),
 ('time_slot',)]

- A simple query that lists all of the students and instructors.


- There are two tables in the database: ```instructor``` and ```student```.


- This statement performs a union, and add an extra field to indicate which table.

In [5]:
%%sql

select ID, name, 'I' as person_type from instructor
union
select ID, name, 'S' as person_type from student
order by name;

 * mysql+pymysql://root:***@localhost
25 rows affected.

[('76653', 'Aoi', 'S'),
 ('98765', 'Bourikas', 'S'),
 ('83821', 'Brandt', 'I'),
 ('19991', 'Brandt', 'S'),
 ('76543', 'Brown', 'S'),
 ('58583', 'Califieri', 'I'),
 ('23121', 'Chavez', 'S'),
 ('76766', 'Crick', 'I'),
 ('22222', 'Einstein', 'I'),
 ('32343', 'El Said', 'I'),
 ('33456', 'Gold', 'I'),
 ('45565', 'Katz', 'I'),
 ('98345', 'Kim', 'I'),
 ('45678', 'Levy', 'S'),
 ('15151', 'Mozart', 'I'),
 ('44553', 'Peltier', 'S'),
 ('55739', 'Sanchez', 'S'),
 ('12345', 'Shankar', 'S'),
 ('76543', 'Singh', 'I'),
 ('70557', 'Snow', 'S'),
 ('10101', 'Srinivasan', 'I'),
 ('98988', 'Tanaka', 'S'),
 ('54321', 'Williams', 'S'),
 ('12121', 'Wu', 'I'),
 ('00128', 'Zhang', 'S')]

# Examples